# GetWallBaseOffset Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExporterIFCUtils..::..GetWallBaseOffset Method
ExporterIFCUtils Class See Also
---
Obtains the base offset of the wall.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public static double GetWallBaseOffset(
	Wall wall
)
```

Visual Basic
---
```text
Public Shared Function GetWallBaseOffset ( _
	wall As Wall _
) As Double
```

Visual C++
---
```text
public:
static double GetWallBaseOffset(
	Wall^ wall
)
```

# ### Parameters
wall
    Type: Autodesk.Revit.DB..::..Wall The wall.
# ### Return Value
The base offset of the wall.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ExporterIFCUtils Class
Autodesk.Revit.DB.IFC Namespace